10_ProcedureToTrackLifeLines/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    WALL 
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    STIRRER // this should be checked again
    {
        type            rotatingWallVelocity;
	origin		(0 0 0);
	axis 		(0 0 1);
	omega		-12.566371;
    } 
      
    HOLDER
    {
        type            noSlip;
    }   

    TOP
    {
        type            symmetry;
    }

    BOTTOM
    {
        type            noSlip;
    } 

    
 
}
// ************************************************************************* //
