10_ProcedureToTrackLifeLines/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 20;

boundaryField
{
    STIRRER
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    WALL
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    HOLDER
    {
        type            epsilonWallFunction;
        value           $internalField;
    }

    TOP
    {
        type            symmetry;
    }

    BOTTOM
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //