10_ProcedureToTrackLifeLines/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    WALL
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    TOP
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    BOTTOM
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    STIRRER
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    HOLDER
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
