10_ProcedureToTrackLifeLines/system/surfaceFeaturesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaces
(
   "WALL.stl"
   "TOP.stl"
   "BOTTOM.stl"
   "STIRRER.stl"
   "HOLDER.stl"
   "MRF.stl"
);

// Identify a feature when angle between faces < includedAngle
includedAngle       120;

// ************************************************************************* //
